app/controllers/items_controller.rb

  def show
    id = params[:id]
    @item = Item.find(id)
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "11"]]

  def index


    @filter_message= params[:search]
    if params[:search]!=nil&&params[:search]!=""
      #@items = Item.order('created_at DESC').paginate(:page => params[:page])
      @items = Item.order(params[:sort] + ' ' + params[:direction]).page(params[:page]).per_page(10)
---
SELECT "items".* FROM "items" ORDER BY created_at DESC
SELECT COUNT(*) FROM "items"

  def create
    params[:item][:user] = session[:user_id]
    @item = Item.create!(params[:item])
---
INSERT INTO "items" ("created_at", "post", "tag", "updated_at", "user", "views", "votes") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", Wed, 11 Dec 2013 05:23:27 UTC +00:00], ["post", "testtesttest"], ["tag", "ubco"], ["updated_at", Wed, 11 Dec 2013 05:23:27 UTC +00:00], ["user", nil], ["views", nil], ["votes", nil]]

  def destroy(id = params[:id])
    @item = Item.find(id)
    @item.destroy
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "10"]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 10]]

  def vote
    @user = User.find(session[:user_id])
    @post = Item.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "3"]]

  def unvote
    @user = User.find(session[:user_id])
    @post = Item.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "2"]]