app/controllers/items_controller.rb

SELECT "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT 1
SELECT "items".* FROM "items" WHERE "items"."tag" IN ('test') ORDER BY created_at DESC
---
  def index
    @filter_message= params[:search]
    @items = Item.all
    if params[:search]!=nil&&params[:search]!=""
      @items = Item.order('created_at DESC').find_all_by_tag(params[:search])