app/controllers/welcome_controller.rb

SELECT "items".* FROM "items" ORDER BY "items"."id" DESC LIMIT 1
---
  def index
    @latest_post = Item.last